{
	"version": "https://jsonfeed.org/version/1",
	"title": "David Owens",
	"icon": "https://micro.blog/owensd/avatar.jpg",
	"home_page_url": "http://thoughts.owensd.io/",
	"feed_url": "http://thoughts.owensd.io/feed.json",
	"items": [
		
		{
			"id": "http://owensd.micro.blog/2018/09/16/i-sometimes-get.html",
	      	
			"content_html": "<p>I sometimes get far too angry about programming annoyances. Latest example:</p>\n\n<div class=\"highlighter-rouge\"><pre class=\"highlight\"><code>private var session: URLSession? = nil\n</code></pre>\n</div>\n\n<p>Simple, but no… I need to do this:</p>\n\n<div class=\"highlighter-rouge\"><pre class=\"highlight\"><code>private var session: URLSession?\n\npublic init(session: URLSession? = nil) {\n    self.session = session\n}\n</code></pre>\n</div>\n",
			"date_published": "2018-09-15T18:50:51-07:00",
			"url": "http://thoughts.owensd.io/2018/09/15/i-sometimes-get.html"
		},
		
		{
			"id": "http://owensd.micro.blog/2018/09/14/i-guess-its.html",
	      	
			"content_html": "<p>I guess it’s time to retire my iPhone SE - its been fun, but back to the giant phones I suppose. iPhone Xs ordered.</p>\n",
			"date_published": "2018-09-14T08:49:34-07:00",
			"url": "http://thoughts.owensd.io/2018/09/14/i-guess-its.html"
		},
		
		{
			"id": "http://owensd.micro.blog/2018/08/31/ah-no-more.html",
	      	
			"content_html": "<p>Ah. No more boiler-plate! I hate boiler-plate. Test infra is now all completely generated for my little pet project.</p>\n\n<div class=\"highlighter-rouge\"><pre class=\"highlight\"><code>➜  proteus git:(master) ✗ make test\nmkdir -p bin/generated\npython ./scripts/generate-tests.py -p ../../ --test-dir tests -o bin/generated/tests.c -i protc/libs.h -i protc/lexer.c -i tests/testlib.h\nmkdir -p bin\nclang -Wall -gmodules bin/generated/tests.c -o bin/protc_tests\nbin/protc_tests\n‡ tests from bin/generated/tests.c\n  ✓ test_minimal_func_decl\n  ✓ test_minimal_func_decl_with_return_type\n  ✓ test_minimal_func_decl_with_return_type_and_crazy_spacing\n\n§ test status (3 of 3) passed.\n</code></pre>\n</div>\n",
			"date_published": "2018-08-31T00:10:57-07:00",
			"url": "http://thoughts.owensd.io/2018/08/31/ah-no-more.html"
		},
		
		{
			"id": "http://owensd.micro.blog/2018/08/30/some-days-it.html",
	      	
			"content_html": "<p>Some days it seems like I’m just spending a bunch of time trying to figure out the least hacky way to do something…</p>\n",
			"date_published": "2018-08-29T18:03:54-07:00",
			"url": "http://thoughts.owensd.io/2018/08/29/some-days-it.html"
		},
		
		{
			"id": "http://owensd.micro.blog/2018/08/29/more-customer-service.html",
	      	
			"title": "More Customer Service Fun",
			
			"content_html": "<p>This time, it’s with Microsoft. As some of my previous <em>thoughts</em> (that’s what I’m calling micro.blog posts 😏) talked about: I upgraded my daughter’s computer due to some case re-arrangments. In th process, I also upgraded my computer to a Ryzen 5 2600X and a new motherboard.</p>\n\n<p>Of course, Windows was not happy. I couldn’t get the activation to work, even though I have a valid Win 10 Pro key purchased from the Microsoft Alumni web store.</p>\n\n<p>So… I called customer support thinking, naïvely it turns out, that it would be much better than my <a href=\"http://thoughts.owensd.io/2018/08/25/why-is-this.html\">IKEA ordeal</a> (oh, and apparently is magically resolved today - we’ll see).</p>\n\n<p>The first rep, which I got in contact with in only a few moments (looking good so far!). Well, this person tried to help me, but since I was getting the dreaded <strong>0xC004E003</strong>, they couldn’t help me and needed to transfer me to the store.</p>\n\n<p>OK, no worries… except they transferred me to a brick-n-mortar Microsoft store. Ugh? This lady was all confused and obviously couldn’t help me with my problem.</p>\n\n<p>So I call back, run through all of the same steps, and the tech couldn’t help me. Says he will transfer me to another tech.</p>\n\n<p>…</p>\n\n<p>…</p>\n\n<p>…</p>\n\n<p>Like 30 minutes later on hold, still crickets.</p>\n\n<hr />\n\n<p>At this point, it’s just better for my health at this point to pay the $40 to buy a new license, as stupid as that is. 🤦🏻‍♂️</p>\n\n<p>May your customer service adventures be more pleasant then mine have been lately.</p>\n",
			"date_published": "2018-08-29T09:07:11-07:00",
			"url": "http://thoughts.owensd.io/2018/08/29/more-customer-service.html"
		},
		
		{
			"id": "http://owensd.micro.blog/2018/08/29/i-think-something.html",
	      	
			"content_html": "<p>I think something is wrong with me… I like writing parsers. 🤔</p>\n",
			"date_published": "2018-08-28T23:21:35-07:00",
			"url": "http://thoughts.owensd.io/2018/08/28/i-think-something.html"
		},
		
		{
			"id": "http://owensd.micro.blog/2018/08/29/oh-my-i.html",
	      	
			"content_html": "<p>Oh my… I just got a random call tonight confirming my delivery for my IKEA furniture I ordered. It must have been found!</p>\n",
			"date_published": "2018-08-28T21:02:01-07:00",
			"url": "http://thoughts.owensd.io/2018/08/28/oh-my-i.html"
		},
		
		{
			"id": "http://owensd.micro.blog/2018/08/27/of-course-all.html",
	      	
			"content_html": "<p>Of course all of IKEA’s customer support “circuits are busy”… the pain keeps coming.</p>\n",
			"date_published": "2018-08-27T08:47:50-07:00",
			"url": "http://thoughts.owensd.io/2018/08/27/of-course-all.html"
		},
		
		{
			"id": "http://owensd.micro.blog/2018/08/25/why-is-this.html",
	      	
			"title": "Why is this so hard!?",
			
			"content_html": "<p>This is beyond ridiculous and just terrible customer service.</p>\n\n<p>Just a brief summary for the fun experience I’ve had trying to order a desk from IKEA (I’ve ordered before with no issues…):</p>\n\n<ul>\n  <li>Ordered a desk on 8/2.</li>\n  <li>Original delivery scheduled for 8/11</li>\n  <li>Attempt to call multiple times to re-schedule for 8/18</li>\n  <li>Shipping calls for delivery, finally updated to 8/18</li>\n  <li>Call for window between 1-4 on 8/18</li>\n  <li>No delivery</li>\n  <li>Call shipping company (multiple times throughout the week), they don’t know where the package is and they have no response from their “dock search”, even with “management involved” (this is T-Force)</li>\n  <li>Multiple calls to IKEA, which has the worst phone system ever… either busy, or you get through to a few menus deep and are told about “Unexpected high call volume” and hung-up on. I’ve called multiple times throughout multiple weeks… this doesn’t seem like “unexpected high call volume”; seems normal.</li>\n  <li><strong>Finally</strong> get to talk to an IKEA customer service rep after 45 minutes on hold. Says, “oh, this is easy to fix”… moments later, he transfers me to the shipping company, that is closed. 🤬🤬🤬🤬</li>\n  <li>FIll out online form to cancel order, no response after 4 days.</li>\n</ul>\n\n<p>So, my options seem to be:</p>\n\n<ul>\n  <li>Continue to wait, irrationally, for my package to be found</li>\n  <li>Continue to waste time on trying to actually get in contact with someone at IKEA’s customer service department</li>\n  <li>Go into IKEA the when I’m up in the office for work, wasting more time to try and get this resolved - of course, since it’s an online order, they are probably going to be unlikely to have the ability to help me</li>\n  <li>Dispute the charge with the credit card company</li>\n</ul>\n\n<p>All I wanted was a desk for my wife’s computer… 😭</p>\n",
			"date_published": "2018-08-25T09:25:56-07:00",
			"url": "http://thoughts.owensd.io/2018/08/25/why-is-this.html"
		},
		
		{
			"id": "http://owensd.micro.blog/2018/08/24/i-got-to.html",
	      	
			"content_html": "<p>I got to ride my bike into work today for the first time in about three weeks: it was nice. =)</p>\n",
			"date_published": "2018-08-24T11:28:03-07:00",
			"url": "http://thoughts.owensd.io/2018/08/24/i-got-to.html"
		},
		
		{
			"id": "http://owensd.micro.blog/2018/08/24/i-hate-graphs.html",
	      	
			"content_html": "<p>I hate graphs like this; they provide no actual information and are clearly meant to tell a story that the author wants you to see instead of providing actual information that you can understands based on facts.</p>\n\n<p>This whole RTX launch seems super sketchy to me.</p>\n\n<p><img src=\"http://thoughts.owensd.io/uploads/2018/408c702eaa.jpg\" width=\"600\" height=\"337\" /></p>\n",
			"date_published": "2018-08-23T22:14:35-07:00",
			"url": "http://thoughts.owensd.io/2018/08/23/i-hate-graphs.html"
		},
		
		{
			"id": "http://owensd.micro.blog/2018/08/23/after-switching-cases.html",
	      	
			"content_html": "<p>After switching cases with my daughter, I got downgraded to a Ryzen 2200. I tried to suffer with huge mid-tower and ATX motherboard and only get a 2600x and 1060 replacement card for me.</p>\n\n<p>Now, I have a new case, ITX MB, and Noctua cooling setup coming this weekend.</p>\n\n<p>¯_(ツ)_/¯</p>\n",
			"date_published": "2018-08-23T01:31:49-07:00",
			"url": "http://thoughts.owensd.io/2018/08/23/after-switching-cases.html"
		},
		
		{
			"id": "http://owensd.micro.blog/2018/08/21/unit-testing-doesnt.html",
	      	
			"content_html": "<p>Unit Testing Doesn’t Need to be Involved: <a href=\"https://owensd.io/2018/08/21/unit-testing-doesnt-need-to-be-involved/\">owensd.io/2018/08/2…</a></p>\n",
			"date_published": "2018-08-21T07:53:53-07:00",
			"url": "http://thoughts.owensd.io/2018/08/21/unit-testing-doesnt.html"
		},
		
		{
			"id": "http://owensd.micro.blog/2018/08/21/minutes-until-my.html",
	      	
			"content_html": "<p>30 minutes until my D&amp;D session… that’s enough time to write some code…</p>\n",
			"date_published": "2018-08-20T19:28:24-07:00",
			"url": "http://thoughts.owensd.io/2018/08/20/minutes-until-my.html"
		},
		
		{
			"id": "http://owensd.micro.blog/2018/08/21/the-rtx-series.html",
	      	
			"content_html": "<p>The RTX 20* series looks pretty interesting, but my guess is they offer little, if any, gain over the current GTX 10* series in terms of FPS for games not specifically built for the architecture, and even then, it looks like it’s going to be a quality boost.</p>\n\n<p>Need some reviews!</p>\n",
			"date_published": "2018-08-20T18:51:33-07:00",
			"url": "http://thoughts.owensd.io/2018/08/20/the-rtx-series.html"
		},
		
		{
			"id": "http://owensd.micro.blog/2018/08/20/im-currently-using.html",
	      	
			"content_html": "<p>I’m currently using the hosted micro.blog service, but that still goes against the spirit of <a href=\"http://owensd.micro.blog/2018/08/16/taking-it-back.html.\">owensd.micro.blog/2018/08/1…</a> I’d really like to set it up so that I can post and aggregrate everything from my own setup, but that requires so much time…</p>\n",
			"date_published": "2018-08-19T23:01:46-07:00",
			"url": "http://thoughts.owensd.io/2018/08/19/im-currently-using.html"
		},
		
		{
			"id": "http://owensd.micro.blog/2018/08/20/i-swapped-my.html",
	      	
			"content_html": "<p>I swapped my CPU and graphics card out with my daughter’s PC so she could have a smaller case to fit on her small desk. <strong>BUT</strong> now my computer won’t really work because the video card cooler fan (hijacked from an eGPU enclosure) hits the CMOS battery. 🤦🏻‍♂️</p>\n",
			"date_published": "2018-08-19T20:00:57-07:00",
			"url": "http://thoughts.owensd.io/2018/08/19/i-swapped-my.html"
		},
		
		{
			"id": "http://owensd.micro.blog/2018/08/19/ive-been-looking.html",
	      	
			"content_html": "<p>I’ve been looking at a photo editing computer for my wife the past few weeks. I went back and forth all over the spectrum (iMac, MBP, PC, Hackintosh). Decided on the 15” MacBook Pro as it allows us to progressively dive deeper with an external display and an eGPU.</p>\n",
			"date_published": "2018-08-18T20:37:32-07:00",
			"url": "http://thoughts.owensd.io/2018/08/18/ive-been-looking.html"
		},
		
		{
			"id": "http://owensd.micro.blog/2018/08/18/ah-now-this.html",
	      	
			"content_html": "<p>Ah, now this is looking much better. Nether with it’s annoying plug though. 😠</p>\n\n<p><img src=\"http://thoughts.owensd.io/uploads/2018/18dac4ae48.jpg\" width=\"600\" height=\"600\" /></p>\n",
			"date_published": "2018-08-18T12:39:18-07:00",
			"url": "http://thoughts.owensd.io/2018/08/18/ah-now-this.html"
		},
		
		{
			"id": "http://owensd.micro.blog/2018/08/18/this-is-just.html",
	      	
			"content_html": "<p>This is just ridiculous. I have nearly three feet of extra coax length here. Hopefully I can shove it up into the wall.</p>\n\n<p><img src=\"http://thoughts.owensd.io/uploads/2018/d236562c3e.jpg\" width=\"600\" height=\"600\" /></p>\n",
			"date_published": "2018-08-18T11:08:39-07:00",
			"url": "http://thoughts.owensd.io/2018/08/18/this-is-just.html"
		},
		
		{
			"id": "http://owensd.micro.blog/2018/08/17/ikea-desk-comes.html",
	      	
			"content_html": "<p>IKEA desk comes tomorrow. Still debating on a 13” MacBook Pro + external display or just canabilizing my gaming PC for my wife’s new photo editing/managing station. And potentially switching it over to an Intel platform. 🤔</p>\n",
			"date_published": "2018-08-17T09:32:48-07:00",
			"url": "http://thoughts.owensd.io/2018/08/17/ikea-desk-comes.html"
		},
		
		{
			"id": "http://owensd.micro.blog/2018/08/17/projects-back-to.html",
	      	
			"title": "Projects: Back to C",
			
			"content_html": "<p>One of the things I really enjoy doing in my space time is playing D&amp;D. Now, I don’t get a lot of time to do it, and when I do get to, I mostly play online. I’ve tried pretty much all of the tools out there from <a href=\"http://roll20.net\">Roll 20</a>, <a href=\"http://fantasygrounds.com\">Fantasy Grounds</a>, <a href=\"http://dndbeyond.com\">D&amp;D Beyond</a>, Discord, and combinations of all of the above.</p>\n\n<p>The problem: none of them actually solve my needs.</p>\n\n<p>This brings me to my current hobby project: an online game management tool. Now, the fundamental problem with Roll 20 and Fantasy Grounds is that they are relatively closed eco-systems; you really need to buy into (quite literally!) in order to make the most of it. Now, Fantasy Grounds is far more flexible and you can basically encode anything you want, it’s a lot of time to do so.</p>\n\n<p>So, that’s where my project comes into play. I really like the premise around <a href=\"http://dndbeyond.com\">D&amp;D Beyond</a>, however, it’s also a fairly closed ecosystem providing no APIs to interact with it. However, since D&amp;D Beyond is mainly a D&amp;D Book archive, I can work with that.</p>\n\n<hr />\n\n<p>Now… the goals of the project are as follows:</p>\n\n<ol>\n  <li>Create a system that works on macOS, iOS, and Windows. My players use varied systems and I need to support all three of those.</li>\n  <li>Create an open ecosystem where there is a fluid flow of information coming into the app and going out of the app. If you love Ulysses or Scrivener for writing your campaigns, use it! The app is to help you run your table top session, not management everything else for you.</li>\n  <li>High performance, low battery impact. A D&amp;D session can be 3~5 hours long and I don’t want people reaching for their chargers part way in or losing access to their character if they are on their laptop or iOS device, especially if we are at the table.</li>\n  <li>A learning project for certain things that I just don’t know too much about, such as low-level graphics frameworks.</li>\n  <li>The foundation for other projects that I have that I’d like to work on… <em>secret projects</em>.</li>\n</ol>\n\n<p>One of the key features, if not the primary feature, is an interactive mapping environment. This is going to likely be a top-down view of a true 3D environment with dynamic lighting, character line-of-sight handling, and turn management tools (including things like measuring movement distances and area of effect areas templates).</p>\n\n<hr />\n\n<p>This brings us to technology and language choices. Now, remember, this is going to be a truly cross-platform app. It also has the need of being run offline or over local-networks only.</p>\n\n<p>The basic choices are:</p>\n\n<ul>\n  <li>web-technology based, such as Electron or Atom</li>\n  <li>game engine based, such as Unreal or Unit</li>\n  <li>using some type of cross-platform application layer</li>\n  <li>handmade, native app</li>\n</ul>\n\n<p>For various reasons that I don’t really want to fully go into here, an Electron-based app is out. High performance, low battery life, small footprint, full offline, and cross-platform make a solution like this challenging, especially for a 3D engine. Sure, WebGL is pretty good, and there is WASM, but ultimately, this is really an unproven technology for this type of application. Also, I’d need a different solution on mobile vs. desktop, which starts to complicate the picture as well.</p>\n\n<p>Ok… so Unreal or Unity based? I haven’t fully rejected this idea, but it would likely only be for the map rendering portion as the vast majority of the rest my content is going to be primary text-based UIs (character sheets, rule references, story content, etc…). Unity… I’ve played around with it in the past and it just didn’t stick with me, so I’d use Unreal if I went this route. The question always is does this dependency warrant the design decisions and complexity? I’m not sure.</p>\n\n<p>Cross-platform layer… no.</p>\n\n<p>A native app. Now, this brings the downside of having to re-build the UI layer for each support platform, and for a hobby and one-man-team, that kinda stinks. BUT! I think it’s totally worth it. This choice also brings with it full control over all aspects of the project and how it is shaped. There’s a lot to be said about this.</p>\n\n<hr />\n\n<p>Language choices: really, there is only really one option that brings straight-forward interop between the various languages choices that may come up: C.</p>\n\n<p>Rust requires bindings and unsafe code; this ends up being a good amount of work to accomplish.</p>\n\n<p>C++ is C++. It’s a very complex and large language. Interop with other languages can be problematic as well.</p>\n\n<p>Swift, well, it’s simply not cross-platform and isn’t going to meet my needs for a Windows install. So it’s out by default.</p>\n\n<p>C is the only language that brings to the table straight-forward interop with all of the platform UI languages (I’ll likely use C# for Windows and ObjC or Swift for macOS and iOS). If I use Swift and I chose C++, I’d have to write a long of interop bindings between the two and that is just a waste of time.</p>\n\n<p>So I’ll be using C and the internet can collectively gasp at my choice. 😀</p>\n",
			"date_published": "2018-08-17T00:49:19-07:00",
			"url": "http://thoughts.owensd.io/2018/08/17/projects-back-to.html"
		},
		
		{
			"id": "http://owensd.micro.blog/2018/08/17/taking-it-back.html",
	      	
			"title": "Taking it Back, One Step at a Time",
			
			"content_html": "<p>Today I’ve started the long process of transitioning all of my online profiles over to places where I have the control of my data and who sees it. I already had a semi-personal, semi-self-work-related location with owensd.io.</p>\n\n<p>But it’s time. Even as much as I trust Apple with my data, there’s no real reason why they should be in charge of my email and data. As for Google… well, I’m far overdue at finally ditching their email services.</p>\n\n<p>Welcome @slofamily.com. Both Twitter and Facebook will be tough to move from, but, even if I can just use those services and <em>linking places</em> for family and friends to find my content, that’s a huge improvement.</p>\n\n<hr />\n\n<p>It’s not much, but it’s a start at starting the process of getting back control.</p>\n",
			"date_published": "2018-08-16T17:28:29-07:00",
			"url": "http://thoughts.owensd.io/2018/08/16/taking-it-back.html"
		},
		
		{
			"id": "http://owensd.micro.blog/2018/08/16/one-of-the.html",
	      	
			"content_html": "<p>One of the things I like most about micro.blog is having the ability to easily separate out the idle chat and information from my <em>real</em> blog content (yeah yeah… I haven’t published there in a while!).</p>\n",
			"date_published": "2018-08-16T15:35:19-07:00",
			"url": "http://thoughts.owensd.io/2018/08/16/one-of-the.html"
		},
		
		{
			"id": "http://owensd.micro.blog/2018/08/16/hmm-i-was.html",
	      	
			"content_html": "<p>Hmm… I was worried about losing out on YouTube Premium (removing ads). Then I proceed to look at my YouTube subscriptions.</p>\n\n<p>Yeah… I can probably ditch this and get some of my evening time back.</p>\n",
			"date_published": "2018-08-16T10:18:20-07:00",
			"url": "http://thoughts.owensd.io/2018/08/16/hmm-i-was.html"
		}
		
	]
}
